Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །འདུ་འཛི་མེད་པ་མང་ཞིང་སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤོང་བ་དང་དགེ་བའི་བཤེས་གཉེན་ལ་རྟེན་པ་དང་ཡོངས་སུ་འདྲི་བའི་རང་བཞིན་ཅན་དང་ཆོས་ཚོལ་བ་ལ་བརྩོན་པ་དང་ཆོས་ལ་དོན་དུ་གཉེར་བ་དང་ཆོས་འདོད་པ་དང་ཆོས་ལ་དགའ་བ་དང་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གཞོན་ནུ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: “Bodhisattva mahāsattvas who have few involvements, avoid bad companions, rely on kalyāṇamitras, have an inquiring nature, unrelentingly seek the Dharma, have the Dharma as their goal, desire the Dharma, delight in the Dharma, obtain the Dharma, and practice the Dharma in accord with the Dharma will, young man, develop great compassion for beings and will develop the aspiration for the highest, complete enlightenment.

source: །གཞན་ཡང་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འདོད་པ་དང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བརྩོན་འགྲུས་བརྩམས་ཤིང་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བྱ་སྟེ། གང་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྟོན་པའི་དགེ་བའི་བཤེས་གཉེན་དེ་དག་རྒྱུན་མི་ཆད་པར་ཡོངས་སུ་བཙལ་བར་བྱ། གཡོ་མེད་པས་བསྙེན་པར་བྱ། བསྟེན་པར་བྱ། རིམ་གྲོར་བྱ་སྟེ།
en: “Moreover, young man, bodhisattva mahāsattvas who wish for this Dharma teaching of entering great compassion and wish to attain the highest, complete enlightenment of perfect buddhahood quickly should be diligent, without regard for life or body, and should continuously seek kalyāṇamitras who teach this Dharma teaching of entering great compassion, and unwaveringly serve them, rely upon them, and honor them.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་བཤེས་གཉེན་དག་ལྷག་པའི་བསམ་པས་ཡོངས་སུ་བཙལ་ནས་ཀྱང་དེ་དག་ལས་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཉན་པར་བྱ། གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། ཀླག་པར་བྱ།
en: “Young man, bodhisattva mahāsattvas who with a higher motivation seek kalyāṇamitras should hear from them the Dharma teaching of entering great compassion, and should obtain it, understand it, preserve it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others.

source: རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པར་བསྒོམ་པས་བསྒོམ་པར་བྱ། མང་དུ་བྱ་གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱའོ། །གང་ལས་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པ་དེ་ལ་དགའ་བ་དང་གུས་པས་སྟོན་པར་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: They should, with joy and veneration, perceive as the Teacher the person from whom they hear this Dharma teaching on entering great compassion.

source: །གཞོན་ནུ་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་ཚོལ་བ་དང་སྲི་ཞུ་བྱ་བ་དང་གཡོག་བྱ་བ་ལ་ཡིད་མི་སྐྱོ་བར་གྱུར་པ་དེའི་ཚེ་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བདེ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །བདེ་བར་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཐོབ་བོ།
en: “Young man, when bodhisattva mahāsattvas search for kalyāṇamitras, and respect them and serve them without weariness, at that time, young man, those bodhisattva mahāsattvas easily attain the highest, complete enlightenment of perfect buddhahood and they obtain this Dharma teaching on easily entering great compassion.

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་མགོ་དང་གོས་ལ་མེ་འབར་བ་བཞིན་དུ་བྱས་ཏེ་རྟག་པར་དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་བཙལ་བར་བྱ། གཡོ་མེད་པས་བསྟེན་པར་བྱ། བསྙེན་པར་བྱ། རིམ་གྲོར་བྱའོ།
en: “Young man, in that way bodhisattva mahāsattvas should constantly seek for kalyāṇamitras as if their head or clothing were on fire, and unwaveringly attend upon them, serve them, and venerate them.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་དགེ་བའི་བཤེས་གཉེན་གྱི་ཁར་ལས་ན། སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་ཅི་སྨོས།
en: Young man, for bodhisattva mahāsattvas the highest, complete enlightenment of perfect buddhahood, not even to speak of this Dharma teaching on entering great compassion, depends upon kalyāṇamitras.

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་བཙལ་བ་དང་སྲི་ཞུ་བྱ་བ་དང་གཡོག་བྱ་བ་ལ་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བར་བྱའོ་ཞེས་གཞོན་ནུ་ཁྱོད་ཀྱིས་རྟག་ཏུ་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: “Therefore, young man, you should always practice by thinking, ‘I will not weary of seeking kalyāṇamitras, venerating them, and serving them.’ ”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ཤིན་ཏུ་བརྗོད་པའི་ཕྱིར་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་སྔོན་བྱུང་བ་བསྟན་པ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Thereupon the Bhagavān, in order to make clear this Dharma teaching on entering great compassion, gave the youth Candraprabha the teaching that had been given in the past in detail in the form of the following verses: “Many incalculable, innumerable,

source: །འདས་པའི་བསྐལ་པ་བྱེ་བ་མང་པོ་སྟེ། །དཔག་ཏུ་མེད་ཅིང་གཞལ་མེད་བསམ་མི་ཁྱབ། །དེ་ཚེ་དབང་ཏོག་རྒྱལ་མཚན་རྒྱལ་པོ་ཞེས།
en: Inconceivable millions of eons in the past,

source: །འདྲེན་པ་རྐང་གཉིས་གཙོ་བོ་བྱུང་བར་གྱུར།
en: There was the highest of humans, The Guide named Indra­ketu­dhvaja­rāja. {1}

source: །དེས་ནི་ཏིང་འཛིན་ཞི་བ་འདི་བཤད་དེ།
en: “He taught this samādhi of peace

source: །དེ་ལ་མི་དང་སྲོག་དང་གང་ཟག་མེད།
en: In which there is no human, soul, or person:

source: །སྒྱུ་མ་ཆུ་བུར་སྨིག་རྒྱུ་གློག་འདྲ་ཞིང་། །ཆོས་རྣམས་ཐམས་ཅད་ཆུ་ཡི་ཟླ་བ་བཞིན།
en: ‘All phenomena are like the moon on water, Illusions, bubbles, mirages, and lightning. {2} “ ‘There is no human, no descendant of Manu, to be found

source: །ཤི་ནས་འཇིག་རྟེན་ཕ་རོལ་འགྲོ་བ་ཡི།
en: Who goes to the next world when his time has come to an end.

source: །སེམས་ཅན་ཤེད་ལས་སྐྱེས་པ་མི་དམིགས་ཀྱང་། །ལས་རྣམས་བྱས་པ་མེད་པར་མི་འགྱུར་ཏེ།
en: However, the karma that has been created will not disappear,

source: །དཀར་གནག་ཇི་བཞིན་འབྲས་བུ་སྨིན་པར་བྱེད།
en: But will give corresponding black or white results. {3}

source: །རིགས་པའི་ཚུལ་གྱི་སྒོ་འདི་བཟང་པོ་སྟེ།
en: “ ‘This is the excellent doorway of the way of logic,

source: །ཕྲ་ཞིང་མཐོང་དཀའ་རྒྱལ་བའི་སྤྱོད་ཡུལ་ཡིན།
en: The subtle, difficult-to-see realm of experience of the jinas. The Bhagavān knows the enlightenment of buddhahood

source: །གང་ལ་ཡི་གེའི་ཚིག་ཀྱང་མི་དམིགས་པ། །སངས་རྒྱས་བྱང་ཆུབ་ཉིད་ནི་བཅོམ་ལྡན་མཁྱེན།
en: In which there are there no words or letters to be found. {4}

source: །ཡངས་པའི་གཟུངས་དང་ཡེ་ཤེས་བསགས་པ་སྟེ།
en: “ ‘Vast retention and the accumulation of wisdom

source: །མདོ་སྡེ་བྱེ་བ་ཁྲག་ཁྲིག་རྣམས་ཀྱང་འབྱུང་།
en: Come from a hundred thousand trillion sūtras.

source: །སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་སྤྱོད་ཡུལ་ཏེ། །ཏིང་འཛིན་འདི་ནི་བཅོམ་ལྡན་རབ་ཏུ་འཆད།
en: The Bhagavān teaches the samādhi That is the field of experience of a hundred thousand trillion buddhas. {5}

source: །འདི་ནི་ན་བ་ནད་ལས་ཐར་བྱེད་པ།
en: “ ‘This frees the sick from their illness.

source: །བྱང་ཆུབ་སེམས་དཔས་བསྒྲུབས་པའི་ནོར་ཡིན་ཏེ།
en: It is the wealth accomplished by bodhisattvas.

source: །སངས་རྒྱས་ཀུན་གྱིས་བསྟོད་ཅིང་རབ་ཏུ་བསྔགས།
en: It is praised and extolled by all buddhas;

source: །བྱེ་བ་ཁྲག་ཁྲིག་ལྷ་ཡིས་རབ་ཏུ་མཆོད།
en: A hundred thousand trillion devas make offerings to it. {6}

source: །སྐྱེ་བོ་བྱིས་པ་ཀུན་ལ་ཡང་དག་སྟོན།
en: “ ‘It is condemned by all foolish beings,

source: །མུ་སྟེགས་ཅན་གྱིས་རྟག་པར་ཡོངས་སུ་སྤངས།
en: And the tīrthikas always reject it.

source: །ཚུལ་ཁྲིམས་ནོར་ནི་མཆོག་ཏུ་སངས་རྒྱས་གསུངས།
en: It is the supreme wealth of conduct that is praised by the buddhas.

source: །ནམ་མཁའ་ལ་ནི་གློག་བཞིན་ཆགས་མི་འགྱུར།
en: It is as undefiled as lightning in the sky. {7}

source: །གང་གིས་རྒྱལ་བ་བྱེ་བ་རབ་མཆོད་ཅིང་།
en: “ ‘Those who make offerings to millions of jinas

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་སྤྱད་པ་མཁས་པ་དང་། །སྔན་ཆད་སྡིག་པའི་གྲོགས་པོ་སྤངས་པ་དག །དེ་དག་གི་ནི་བླ་མེད་ཕ་རོལ་ནོར།
en: Are wise in the practice of generosity and correct conduct, Have forsaken their previous bad companions, And have an unsurpassable inheritance of wealth.’ {8}

source: །དེ་ན་དགེ་སློང་ཆོས་སྨྲ་འདུག་པ་དག །
en: “There was present a bhikṣu, a dharmabhāṇaka,

source: ཚངས་པར་སྤྱོད་པ་བདེ་གཤེགས་ཐུགས་ཀྱི་སྲས།
en: A celibate who was the heart son of the Sugata.

source: །རྗེས་སུ་འཐུན་པའི་ཆོས་འདི་ཐོས་ནས་ནི།
en: When he had heard this benevolent Dharma,

source: །འཇིག་རྟེན་འདྲེན་པར་སེམས་ཀྱང་བསྐྱེད་པར་གྱུར།
en: He developed the aspiration to be a guide of the world. {9}

source: །འདྲེན་པ་དབང་ཏོག་རྒྱལ་མཚན་རྒྱལ་པོ་ཡིས།
en: “The Guide, Indra­ketu­dhvaja­rāja,

source: །ཆོས་སྨྲ་དེ་ལ་ཡང་ནི་ཚིག་གསུངས་པ།
en: Said to the dharmabhāṇaka,

source: །དགེ་སློང་དངོས་པོ་མཆོག་ཏུ་བྱ་དཀའ་ཡིས།
en: ‘Bhikṣu, develop the supreme, difficult-to-attain

source: །བྱང་ཆུབ་དམ་པ་མཆོག་ལ་སེམས་སྐྱེད་ཅིག །ནོར་བུ་རིན་ཆེན་འདྲ་བར་ཚུལ་ཁྲིམས་སྲུངས།
en: Motivation for the highest enlightenment. {10} “ ‘Maintain the conduct that is like a precious jewel,

source: །རྗེས་སུ་འཐུན་པའི་གྲོགས་ལ་རྟག་པར་སྟེན།
en: Always depend on favorable friends,

source: །སྡིག་པའི་གྲོགས་ལ་ནམ་ཡང་མ་བསྟེན་དང་། །སངས་རྒྱས་ཡེ་ཤེས་རིང་པོར་མི་ཐོགས་འཐོབ།
en: Never depend on friends whose actions are evil And before long you will attain buddha wisdom.’ {11} “The one who developed the aspiration to enlightenment

source: །དབང་པོ་ཏོག་གི་རྒྱལ་མཚན་རྒྱལ་བའི་དྲུང་།
en: In the presence of Indra­ketu­dhvaja­rāja

source: །གང་གིས་བྱང་ཆུབ་སེམས་མཆོག་བསྐྱེད་པ་ནི། །དེ་དག་ཐམས་ཅད་ཆོས་སྨྲར་རབ་འགྱུར་ཏེ།
en: Became a supreme dharmabhāṇaka,

source: །ཚངས་པར་སྤྱོད་པ་བདེ་གཤེགས་ཐུགས་ཀྱི་སྲས།
en: A celibate who was the heart son of the Sugata.” {12}

source: །དབང་པོའི་ཏོག་གི་རྒྱལ་མཚན་གྱི་རྒྱལ་པོའི་ལེའུ་སྟེ་ཉི་ཤུ་པའོ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ། བམ་པོ་བདུན་པ།
en: Conclusion of the twentieth chapter, “Indra­ketu­dhvaja­rāja.” The Past Chapter 21

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་རྩ་བ་དང་བསླབ་པ་དང་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་ལ་གདོན་མི་ཟ་བར་བྱའོ། །འདུ་འཛི་མང་བ་མ་ཡིན་པར་བྱའོ། །སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤངས་ཤིང་དགེ་བའི་བཤེས་གཉེན་ལ་རྟེན་པ་དང་ཡོངས་སུ་དྲི་བའི་རང་བཞིན་ཅན་དང་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པ་དང་ཆོས་ལ་དོན་དུ་གཉེར་བ་དང་ཆོས་འདོད་པ་དང་ཆོས་ལ་དགའ་བ་དང་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་ཆོས་དང་ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པ་ལ་ཞུགས་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas should entertain no misgivings about all the teachings on the root of merits, the training, and the qualities. They should have few involvements, avoid bad companions, rely on kalyāṇamitras, have an inquiring nature, unrelentingly seek the Dharma, have the Dharma as their goal, desire the Dharma, delight in the Dharma, obtain the Dharma, and practice the Dharma in accord with the Dharma.

source: །དེས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་སྟོན་པར་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: They should perceive every buddha and bodhisattva as the teacher.

source: །གང་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པ་དེ་ལ་ཡང་དེས་དགའ་བ་དང་གུས་པས་སྟོན་པར་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: They should with joy and veneration perceive as the teacher the person from whom they hear this Dharma teaching.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དགེ་བའི་རྩ་བ་དང་བསླབ་པ་དང་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་གདོན་མི་ཟ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་དག་པར་བླངས་ཏེ་གནས་ན་དེ་མྱུར་དུ་སྤོབས་པ་རྒྱུན་མི་འཆད་པ་ལས་ངེས་པར་འབྱུང་བར་འགྱུར་རོ།
en: “Young man, bodhisattva mahāsattvas who adopt and follow this Dharma teaching of entertaining no misgivings about all the teachings on the root of merits, the training, and the qualities will quickly display unending confidence of speech.

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མོས་པར་འགྱུར་རོ།
en: They will accomplish the inconceivable Dharma of the Buddha.

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཟབ་མོ་ལ་ངེས་པར་རྟོགས་པར་འགྱུར་རོ།
en: They will realize the profound Dharma of the Buddha.

source: །ལྷར་བཅས་པའི་འཇིག་རྟེན་གྱི་ནེམ་ནུར་དང་ཡིད་གཉིས་དང་ཐེ་ཚོམ་གྱི་མུན་པ་སེལ་བའི་ཕྱིར་སྣང་བ་ལྟ་བུར་འགྱུར་རོ།
en: They will be like a light that dispels the darkness of perplexity, uncertainty, and doubt of the people of the world and the devas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་དགེ་བའི་རྩ་བ་དང་བསླབ་པ་དང་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་ངེས་པར་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བརྗོད་པའི་ཕྱིར་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་སྔོན་བྱུང་བའི་གཏམ་གྱི་རྒྱུད་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་བསྟན་པ།
en: Then at that time, in order to relate this Dharma teaching of entertaining no misgivings about all the teachings on the root of merits, the training, and the qualities, he spoke to the youth Candraprabha these verses that told of the past.

source: སྔོན་བྱུང་འཛམ་བུའི་གླིང་ཞེས་བྱ་བ་འདིར།
en: “In the past, in this world named Jambudvīpa,

source: །གཡེལ་བ་མེད་པའི་ཁྱེའུ་མཆོག་གཉིས་བྱུང་སྟེ།
en: There were two excellent sons who were not heedless.

source: །བདེ་བར་གཤེགས་པའི་བསྟན་ལ་རབ་བྱུང་ནས།
en: They entered homelessness in the teaching of a sugata,

source: །བསེ་རུ་བཞིན་དུ་ནགས་ཁྲོད་སྟུག་པོར་གནས།
en: And dwelt like rhinoceroses in a grove of trees. {1}

source: །རྫུ་འཕྲུལ་ལྡན་ཞིང་བསམ་གཏན་བཞི་རྣམས་ཐོབ།
en: “They had miraculous powers and had attained the four dhyānas,

source: །སྙན་དངགས་བསྟན་བཅོས་མཁས་ཤིང་རྫོགས་པ་སྟེ།
en: They were very learned and skilled in composing poetry and texts,

source: །བར་སྣང་གི་ནི་རྗེས་དང་ས་ཡང་རིག །དེ་དག་ནམ་མཁའ་ལ་ཡང་ཐོགས་མེད་འགྲོ།
en: They had mastered levitating up into the air, And they could travel freely through the sky. {2} “They were engaged in conversation

source: །དེ་དག་ནགས་ཁྲོད་སྟུག་པོ་བསིལ་བ་དེར།
en: In that cool grove of trees

source: །མེ་ཏོག་སྣ་ཚོགས་ཡིད་དུ་འོང་བས་གང་།
en: That was filled with a variety of beautiful flowers

source: །བྱ་ཡང་སྣ་ཚོགས་མང་པོས་བསྙེན་པ་དེར། །ཕན་ཚུན་དུ་ནི་གཏམ་དག་རབ་ཏུ་སྨྲ།
en: And attended by flocks of varieties of birds. {3}

source: །རྒྱལ་པོ་རི་དགས་འཆོར་ཞིང་སོང་སོང་ན།
en: “A king who was pursuing a deer

source: །སྒྲ་གྲགས་ནས་ནི་ནགས་ཚལ་དེར་འོངས་ཏེ།
en: Heard their voices and entered that grove.

source: །རྒྱལ་པོས་ཆོས་སྨྲ་དེ་གཉིས་མཐོང་ནས་ནི།
en: The monarch saw the two dharmabhāṇakas

source: །དེ་ལ་མཆོག་ཏུ་དགའ་བ་ཉེ་བར་བཞག །དེ་དང་རྗེས་སུ་འཐུན་པའི་གཏམ་བྱས་ནས།
en: And with the greatest joy he approached them. {4} “They addressed each other agreeably

source: །དེ་དག་རྒྱལ་པོའི་མདུན་དུ་འདུག་པ་དང་། །རྒྱལ་པོ་དེ་ཡི་དམག་མང་མཐའ་ཡས་པ།
en: And the king sat down before them. The king’s multitudinous army

source: །བྱེ་བ་ཁྲག་ཁྲིག་དྲུག་ཅུ་ཉེ་བར་ལྷགས།
en: Of sixty quintillion soldiers approached. {5}

source: །དེ་ནས་ཆོས་སྨྲ་དེ་དག་སོ་སོ་ནས།
en: “Then both of those dharmabhāṇakas

source: །རྒྱལ་པོ་དེ་ལ་སྨྲས་པ་རྒྱལ་རིགས་ཉོན།
en: Said to the king, ‘Listen, Kṣatriya!

source: །སངས་རྒྱས་འབྱུང་བ་མཆོག་ཏུ་རྙེད་པར་དཀའ།
en: It is very difficult to reach supreme buddhahood.

source: །ས་ཡི་བདག་པོ་རྟག་ཏུ་བག་ཡོད་གྱིས།
en: Monarch, always be careful! {6}

source: །ཚེ་ནི་རྟག་ཏུ་འགྲོ་ཞིང་མི་གནས་ཏེ།
en: “ ‘Life is always passing and never stays.

source: །རི་ཡི་ཆུ་བོ་བཞིན་དུ་མྱུར་དུ་འགྲོ།
en: It passes as quickly as a mountain stream.

source: །ནད་དང་མྱ་ངན་རྒ་བས་གཟིར་བ་ལ།
en: From the torment of illness, misery, and aging

source: །ཁྱོད་ལ་དགེ་བའི་ལམ་འདྲ་སྐྱབས་གཞན་མེད།
en: You have no other refuge than good actions. {7}

source: །རྒྱལ་པོའི་གླང་པོ་ཆོས་རྣམས་བསྐྱང་བར་གྱིས།
en: “ ‘Supreme king, be a protector of the Dharma.

source: །སྟོབས་བཅུ་ལྡན་པའི་བསྟན་པ་འདི་ཡང་སྲུངས།
en: Guard the teaching of the one with ten strengths

source: །ཟད་པའི་དུས་ལ་ཤིན་ཏུ་འཇིག་པའི་ཚེ།
en: In this utterly terrible time of degeneration.

source: །རྒྱལ་པོའི་གླང་པོ་ཆོས་ཀྱི་ཕྱོགས་གནས་གྱིས།
en: Remain on the side of Dharma, supreme king!’ {8}

source: །དེ་ལྟར་དེ་ཚེ་མཁས་པ་དེ་དག་གིས།
en: “Thus the wise ones at that time

source: །རྣམ་པ་དུ་མར་མི་དབང་གདམས་པ་བྱས།
en: Gave much advice to that sovereign,

source: །རྒྱལ་པོ་ཁྲག་ཁྲིག་དྲུག་ཅུར་བཅས་པ་ཡིས།
en: Following which the monarch, with the other six quintillions,

source: །དེ་ཚེ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ།
en: Developed the aspiration to enlightenment. {9}

source: །དེ་ཚེ་རྒྱལ་པོའི་གླང་པོ་ཆོས་ཐོས་ནས། །དེས་ཤིང་དགེ་བའི་ཆོས་རྣམས་སྨྲ་བ་ལ།
en: “When the supreme king had heard the Dharma,

source: །རངས་ཤིང་ཡིད་བདེ་དགའ་བ་རབ་སྐྱེས་ནས།
en: He was joyful, very happy, and enraptured With those who had spoken it so gently and pleasantly,

source: །རྐང་པ་ལ་ཡང་ཕྱག་འཚལ་དེ་ནས་སོང་།
en: And bowed down to their feet before departing. {10}

source: །རྒྱལ་པོ་དེ་ཡི་དགེ་སློང་མང་པོ་དག །རྙེད་པ་འདོད་ཅིང་དེ་ཡི་ཁྱིམ་དུ་འཇུག །
en: “Under that king there were many other bhikṣus Who desired gain and who entered homes.

source: དེ་དག་དེ་མི་འདྲ་བའི་སྤྱོད་མཐོང་ནས།
en: When he saw how dissimilar was their conduct

source: །དེ་ལ་རྒྱལ་པོ་དེ་ལྟར་རི་མོ་མེད།
en: The king did not show them respect. {11}

source: །བསྟན་པ་དེ་ཡང་སྟོན་པ་འདས་པ་ཡི།
en: “The teacher of the teaching had passed away

source: །དེ་ཚེ་ལོ་ཡི་ཐ་མར་གྱུར་པ་སྟེ།
en: And this was the time of the latter years.

source: །འཛམ་བུའི་གླིང་ན་སྣོད་གྱུར་རབ་ཏུ་ཉུང་།
en: There were very few worthy recipients in Jambudvīpa,

source: །མ་བསྡམས་པ་དག་ཤིན་ཏུ་མང་པོ་བྱུང་།
en: And there were present many who were without self-control. {12}

source: །དེ་ནས་དགེ་སློང་མང་པོ་བརྐམ་ཞིང་ཆགས།
en: “The many bhikṣus, who were desirous and greedy,

source: །རྙེད་པ་འདོད་ཅིང་དམིགས་པའི་ལྟ་བ་ཅན།
en: Yearned for acquisitions, held the view of objective reality,

source: བདེ་གཤེགས་བསྟན་པ་རབ་ཏུ་ཞིག་པའི་ཚེ།
en: And had fallen away from the Sugata’s teaching,

source: །རྒྱལ་པོ་དེ་ཡང་བསྒྱུར་ཅིང་བྱེད་དུ་བཅུག །ཆོས་སྨྲ་གཉིས་པོ་འདི་ནི་གསད་པར་གྱིས།
en: At that time repeatedly urged the king to action. {13} “ ‘You must kill those two dharmabhāṇakas.

source: །འདི་དག་མུ་སྟེགས་ཆད་པར་སྨྲ་བ་སྟེ།
en: They are tīrthikas who are teaching nihilism.

source: །ཡུན་རིང་སྤྱོད་པར་ཡང་དག་འཛུད་བྱེད་ཀྱང་།
en: Among those who have adopted that practice for a long time

source: །དེ་དག་གང་དུའང་མྱ་ངན་འདའ་མི་སྟོན།
en: There are none who have attained nirvāṇa. {14}

source: །ལས་ཀྱང་འཇིག་ཅིང་རྣམ་པར་སྨིན་པ་འཇིག །ཚུལ་འཆོས་འདི་དག་ཕུང་པོ་མེད་ཅེས་སྨྲ།
en: “ ‘They deny karma, they deny ripening; Those imposters teach that there are no skandhas.

source: །རྒྱལ་པོ་འདི་དག་ཡུལ་ནས་སྤངས་ནས་ནི།
en: Your Majesty, banish them from the land

source: །འདིར་ཡང་ཆོས་ནི་ཡུན་རིང་གནས་པར་འགྱུར།
en: And then the Dharma will remain for a long time.’ {15}

source: །དེ་དག་གི་ནི་ཚིག་ཐོས་དེ་ཡི་ཚེ།
en: “When he had listened to what they had to say,

source: །རྒྱལ་པོའི་གླང་པོ་ཐེ་ཚོམ་བྱུང་བར་གྱུར།
en: The elephant-like king became distrustful.

source: །ཆོས་སྨྲ་གཉིས་པོ་འདི་ནི་གསད་པར་བྱ།
en: ‘I shall kill these two dharmabhāṇakas.

source: །བཏང་སྙོམས་བཞག་ན་གནོད་པར་འགྱུར་སྲིད་སྙམ།
en: I must not leave them alone, for that would be harmful.’ {16}

source: །རྒྱལ་པོ་དེ་ཕྱིར་འབྲང་བ་ལྷ་མོ་ཞིག །ཚེ་རབས་སྔ་མར་ལྷན་ཅིག་སྤྱོད་པ་སྤྱད།
en: “The king was attended by a goddess Who had practiced with him in a previous lifetime.

source: །ཡུན་རིང་དུས་ནས་ཕན་འདོད་མཁས་པ་སྟེ།
en: She was wise and had benefited him for a long time,

source: །དེ་ཡིས་རྒྱལ་པོ་དེ་ལ་འདི་སྐད་སྨྲས།
en: And at this time she said to the sovereign king, {17} “ ‘Kṣatriya, do not think in this way

source: །རྒྱལ་རིགས་སྡིག་པའི་གྲོགས་པོའི་ཚིག་དག་གིས།
en: Because of what bad associates have said.

source: །འདི་ལྟ་བུ་ཡི་སེམས་ནི་མ་སྐྱེད་ཅིག །དགེ་སློང་ཆོས་སྨྲ་མཁས་པ་གཉིས་པོ་འདི།
en: Do not kill those two wise dharmabhāṇakas

source: །སྡིག་པའི་གྲོགས་པོའི་ཚིག་གིས་མ་སྤོང་ཤིག །དེ་དག་གིས་ནི་ནགས་ཁྲོད་ཅི་བཤད་པ།
en: Because of what bad associates have said. {18} “ ‘Lord of men, do you not remember even a little Of what they said to you in the forest grove?

source: །ཤིན་ཏུ་འཇིགས་པ་མི་བཟད་དུས་ཀྱི་ཚེ།
en: In this perfectly terrible time of degeneration,

source: །རྒྱལ་པོའི་གླང་པོ་ཆོས་ཀྱི་ཕྱོགས་གནས་ཀྱིས། །མི་ཡི་བདག་པོ་ཅུང་ཟད་མི་དྲན་ནམ།
en: Remain on the side of Dharma, elephant-like king!’ {19}

source: །རྒྱལ་པོ་ཡང་དག་ཚིག་གིས་བསྐུལ་བ་ཡིས།
en: “The king, inspired by those true words,

source: །དེ་ནི་རྒྱལ་བའི་བསྟན་པ་མི་གཏོང་གྱུར།
en: Did not abandon the teachings of the jinas.

source: །དེ་ཚེ་རྒྱལ་པོའི་ནུ་བོ་མ་རུངས་པ།
en: But the king had a cruel brother

source: །ཉེན་ཀོར་རྒྱལ་པོ་བྱེད་པ་དེས་རྦད་དེ།
en: Who was persuaded by those around him. {19b–20a}

source: །རྒྱལ་པོ་ཁྱོད་ཀྱི་གཅེན་ནི་སྡིག་པ་ཅན།
en: “They told him, ‘The king, your brother, is wicked;

source: །བདག་གི་སྲོག་ཀྱང་ནམ་དུ་འདོད་མི་བྱེད།
en: He has no joy in being alive.

source: །དགེ་སློང་གཉིས་པོ་རིག་སྔགས་དྲག་ལྡན་པ།
en: Those two bhikṣus possess dreadful spells.

source: །དེ་དག་ནམ་མཁའ་ལ་ཡང་སྔགས་ཀྱིས་འགྲོ།
en: With those spells they can fly through the sky. {20}

source: །དེ་ཐོས་ནས་ནི་ཁྱོད་ཀྱི་དྲུང་དུ་འོང་།
en: “ ‘Having heard this we have come to you,

source: །ཐམས་ཅད་འདུས་ཏེ་གསོལ་བ་འདེབས་པ་ནི།
en: To tell you all that has occurred.

source: །རིག་སྔགས་དྲག་ལྡན་འདི་གཉིས་མྱུར་དུ་སོད།
en: Quickly kill those dreadful magicians,

source: །ཕྱིས་གདོད་འགྱོད་པར་གྱུར་ན་མ་ལེགས་སོ།
en: Or afterward you will be filled with regret.’ {21}

source: །དེ་ཚེ་རྒྱལ་པོའི་གླང་པོ་གོ་བགོས་ནས།
en: “Then the king’s brother put on his armor,

source: །སྡིག་པའི་གྲོགས་ཀྱི་ཚིག་གིས་དེར་ཆས་ཏེ།
en: Under the influence of those bad associates.

source: །རྒྱལ་པོ་དམག་སྡེ་ཀུན་གྱིས་ཡོངས་བསྐོར་ནས།
en: The king’s brother, encircled by his entire army,

source: །ནགས་ནས་དགེ་སློང་གང་ན་ཡོད་པར་ལྷགས། །རྒྱལ་པོ་མི་ཟད་དྲག་ཤུལ་སེམས་རིག་ནས།
en: Came to the forest where the two bhikṣus dwelt. {22}

source: །ཀླུ་དང་གནོད་སྦྱིན་ནགས་དེར་གནས་པ་ཡིས།
en: “The nāgas and yakṣas that lived in that forest Knew the intention of the king’s dreadful, cruel brother

source: །རྡོ་དང་སོ་ཕག་ཆར་ཕབ་ཕྱིར་བསྐྲད་དེ།
en: And hurled upon them a rain of bricks and stones

source: །དེས་ནི་རྒྱལ་པོ་སྡེ་དང་བཅས་པ་བཏགས། །ལྟོས་ཤིག་སྡིག་པའི་གྲོགས་ཀྱི་ཚིག་གིས་ནི།
en: That killed the king’s brother and his army. {23}

source: །དེ་ཚེ་མ་རུངས་རྒྱལ་པོ་འཆི་དུས་བྱས།
en: “See how the life of the king’s cruel brother came to an end

source: །ཆོས་སྨྲ་དག་ལ་ཁྲོ་བ་བྱས་པས་ན།
en: Because he listened to what bad associates said. Those who were angry at the dharmabhāṇakas

source: །དེར་ནི་ཚེ་རབས་དྲུག་ཅུར་མནར་མེད་སོང་། །རྒྱལ་རིགས་རྒྱལ་པོ་གང་གིས་རྦད་པ་ཡི།
en: Took rebirth sixty times in the Avīci hell. {24}

source: །དགེ་སློང་དམིགས་ལྟ་མང་པོ་དེ་དག་ཀྱང་།
en: “Those numerous bhikṣus who believed in reality And drove the kṣatriya king to action

source: །ཚེ་རབས་བྱེ་བ་བརྒྱ་ཕྲག་བསམ་ཡས་སུ། །སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་མྱོང་བར་གྱུར།
en: Experienced the sufferings of hell For countless billons of rebirths. {25}

source: །ལྷ་མོ་གང་གིས་རྒྱལ་པོ་བསྐུལ་བསྟན་ཅིང་།
en: “The goddess who influenced the king

source: །གང་གིས་ཆོས་སྨྲ་དེ་དག་བསྲུངས་པ་ནི།
en: And protected the dharmabhāṇakas

source: །སངས་རྒྱས་གང་གཱའི་བྱེ་མ་མཉམ་པ་མཐོང་།
en: Saw buddhas as numerous as sand grains in ten million Ganges,

source: །སྤྱད་པ་སྤྱོད་ཅིང་དེ་དག་མཆོད་པ་བྱས།
en: Made offerings to them, and engaged in practice. {26}

source: །བྱེ་བ་ཁྲག་ཁྲིག་དྲུག་ཅུ་མཐའ་ཡས་པས།
en: “The multitudinous six quintillion men,

source: །རྒྱལ་པོ་དང་ནི་ལྷན་ཅིག་ཆོས་ཐོས་ཤིང་།
en: Who with the king had heard the Dharma

source: །བྱང་ཆུབ་ཏུ་ནི་སེམས་མཆོག་བསྐྱེད་པ་དག །འཇིག་རྟེན་ཁམས་མང་དུ་ཡང་སངས་རྒྱས་གྱུར།
en: And developed the aspiration to enlightenment, Became buddhas in numerous different realms. {27}

source: །དེ་དག་ཚེ་ཚད་བསྐལ་པ་བྱེ་བ་མང་།
en: “Their lifespans were many millions of eons.

source: །དེ་དག་ཡེ་ཤེས་གཞལ་མེད་བསམ་མི་ཁྱབ།
en: They had inconceivable, unequaled wisdom.

source: །དེ་དག་ཀུན་གྱིས་ཏིང་འཛིན་བཟང་པོ་འདི།
en: They all taught this excellent samādhi,

source: །བཤད་ནས་རྐང་གཉིས་གཙོ་བོ་མྱ་ངན་འདས།
en: And then those supreme humans passed into nirvāṇa. {28} “Having heard this unsurpassable teaching

source: །ཚུལ་ཁྲིམས་ཚངས་པ་ཡོན་ཏན་ཡེ་ཤེས་བསགས། །བླ་ན་མེད་པའི་ཚིག་འདི་ཐོས་ནས་ནི།
en: On the accumulation of correct conduct, purity, qualities, and wisdom,

source: །གཡེང་བ་མེད་པར་བག་ཡོད་སྤྱོད་ཅིག་དང་། །སངས་རྒྱས་ཡེ་ཤེས་རིང་པོར་མི་ཐོགས་འཐོབ།
en: You must practice intently, without distraction, And quickly attain the wisdom of buddhahood. {29}

source: །ཕྱོགས་བཅུ་དག་གི་དེ་བཞིན་གཤེགས་པ་རྣམས།
en: “Look upon us, you tathāgatas in the ten directions,
